/*
3. Створити два довільні масиви:
   один масив - улюблена спортивна команда / моделі автомобілів / міста,
   у другому – кількість гравців у команді/обсяг двигуна/кількість мешканців у місті.
   З двох масивів зробіть асоціативний масив (об'єкт).
   Масив, який виступатиме як ключ - повинен містити унікальні значення

   Наприклад:
   let keys = ["id", "name"];
   let values = [1, "Vlad"];

   В результаті має вийде таке:
   {
   "id": 1,
   "name": "Vlad"
   }
*/

function population(keys, values) {
  keys = ["Kyiv", "Kharkiv", "Kherson", "Hola Prystan"];
  values = ["2.8m", "1.4m", "289k", "14k"];

  let all = {};

  for (let i = 0; i < keys.length; i++) {
    all[keys[i]] = values[i];
  }
  console.log(all);
}

population();
